tap "hashicorp/tap"
tap "heroku/brew"
tap "supabase/tap"
tap "replicate/tap"
tap "xo/xo"


# GitHub
brew "act"
brew "action-validator"
brew "actionlint"
brew "gh"
brew "git"
brew "git-open"


# Docker
brew "dive"


# Terraform etc.
brew "atmos" # Terraform tool – marketing is horrible
brew "aztfexport"
brew "cdktf" # cloud development kit for terraform
brew "hashicorp/tap/packer"
brew "hashicorp/tap/terraform"
brew "pulumi"
brew "terragrunt"
brew "terramate"
brew "tfsec"


# Ansible
brew "ansible"
brew "ansible-cmdb"
brew "ansible-creator"
brew "ansible-lint"
brew "molecule"

# Kubernetes
brew "argo"
brew "argocd"
brew "argocd-autopilot"
brew "argocd-vault-plugin"
# brew "calicoctl"
brew "cdk8s" # cloud development kit for kubernetes
brew "cyctl" # really cool ui tool
brew "helm"
brew "helmfile"
# brew "istioctl"
brew "kompose"
brew "kops"
brew "kubectl"
brew "kubescape"
brew "kustomize"
brew "k9s"
brew "minikube"

cask "rancher"


# Nomad
brew "hashicorp/tap/nomad"


# Data Formats - JSON & YAML
brew "jq"
brew "jql"
brew "yamale" # schema validator
brew "yamllint" # checker
brew "yh" # highlighter
brew "yj" # YAML to JSON or TOML or HCL converter
brew "yq" # jq for YAML, JSON, XML, CSV, and TOML

# Data Formats - CSV
brew "xsv" # looks very useful for csv files though kinda abandoned

# Data Formats - Protocol Buffers
brew "buf" # protocol buffers
brew "grpcurl"


# Google Cloud
brew "apib"    # API tool
brew "berglas" # secrets manager
brew "bigquery-emulator"
brew "firebase-cli"
brew "yatas" # AWS/GCP audit tool

cask "google-cloud-sdk"

# AWS
brew "amazon-ecs-cli"
brew "athenacli"
brew "aws-amplify"
brew "aws-auth"
brew "aws-cdk"
brew "aws-console"
brew "aws-google-auth"
brew "aws-iam-authenticator"
brew "aws-keychain"
brew "aws-nuke"
brew "aws-rotate-key"
brew "aws-shell"
brew "aws-sso-cli"
brew "aws-vault"
brew "awscli"
brew "awscli-local"
brew "awscurl"
brew "awsdac" # diagram tool from aws labs
brew "awslogs"


# Cloudflare
brew "cloudflared"
brew "cloudflare-wrangler2"
brew "flarectl"


# Backblaze
brew "b2-tools"


# Networking - Application
# DNS
brew "airshare"
brew "bind" # dig
brew "dnsgen"
brew "dnstracer"
brew "massdns"
# HTTP
brew "curl"
brew "httpie"
brew "newman"
cask "postman"
# WebSocket
brew "websocat"
# VPN
brew "bore-cli" # only 400 lines of code
brew "boringtun"
cask "ngrok"
cask "tailscale"
# Captures
brew "tcpdump"
brew "yaf" # really useful networking data pipeline architecture and flow record display tool
cask "wireshark"

# Networking - Transport
brew "aerleon" # Generates firewall configurations
brew "netcat"
brew "nmap"


# Networking - Routing
brew "asn"
brew "asnmap"
brew "asroute"
brew "bgpq4"
brew "bgpstream"
brew "ipinfo-cli"
brew "lft"
brew "mtr"

# Networking - Data Link
brew "arp-scan"
brew "arping"
brew "cdpr" # cisco discovery protocol reporter


# Certificates
brew "amass"
brew "ccheck" # certificate expiration checker
brew "certbot" # certificate automation
brew "certgraph" # crawls the graph of certificate Alternate Names and their website also links to huge crt.sh database
brew "certigo" # by square - examines and validates certificates
brew "certstrap" # by square - tools to bootstrap CAs, certificate requests, and signed certificates

brew "openssl"
brew "zlint" # certificate checker, see also zcertificate and zschema


# zsh
brew "pure"
brew "zsh"
brew "zsh-autocomplete"
brew "zsh-autopair"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# brew "argus" potentially interesting to use later
# brew "argus-clients" 



brew "align"
brew "agg"  
brew "angle-grinder"
brew "anycable-go"
brew "apachetop"
brew "apibuilder-cli"
brew "apify-cli"
brew "apko"
brew "apprise"
brew "appwrite"
brew "argc"
brew "arjun"
brew "arkade"
brew "artillery"
brew "as-tree"
brew "asciinema"
brew "asdf"
brew "ast-grep"
brew "atlantis" # looks useful
brew "atlas" # looks useful
brew "autorest"
brew "awsume"
brew "awsweeper"
brew "authz0"
brew "autorest"
brew "azure-cli"
brew "badkeys"
brew "bat"
brew "bbot"
# brew "bfs" # the GitHub page has a nice neutral tone terminal background
brew "bitwarden-cli"
brew "blackbox"
# brew "bpftop" # for Linux only but useful
# brew "brev" # cringe marketing but saving it here anyway
brew "buildpulse-test-reporter"
# brew "butane" for Linux only
brew "c2rust"
brew "c7n" # very interesting or useful ci pipeline cloud analysis tool thing
# brew "caddy" # check this out for simpler server use cases than traefik
# brew "cadence-workflow" # Uber's workflow engine
brew "caire" # super useful content-aware image resizer
# brew "capnp" # apparently Cloudflare workers use this
# brew "cariddi" # really does not look useful but I just like go command line tools 😂
# brew "carthage" # for iOS development
# brew "cascadia" HTML selector tool
# brew "ccm" # cassandra
brew "checkov"
brew "choose-rust"
brew "circleci"
brew "corepack"
brew "cosign"
brew "deno"
brew "difftastic"
brew "direnv"
brew "doctl"
brew "doggo"
brew "doppler"
brew "erdtree"
brew "fabric"
brew "fastlane"
brew "fclones"
brew "fd"
brew "feroxbuster"
brew "flyctl"
brew "gdu"
brew "ghz"
brew "gibo"
brew "gitleaks"
brew "glab"
brew "go"
brew "goreleaser"
brew "goose"
brew "gping"
brew "graphviz"
brew "grex"
brew "gron"
brew "grype"
brew "hasura-cli"
brew "heroku/brew/heroku"
brew "hurl"
brew "hyperfine"
brew "imagemagick"
brew "lefthook"
brew "linode-cli"
brew "manim"
brew "mas"
brew "md5deep"
brew "monolith"
brew "muffet"
brew "naabu"
brew "netlify-cli"
brew "nexttrace"
brew "nixpacks"
brew "node"
brew "oci-cli"
brew "okteto"
brew "opa"
brew "openssh"
brew "pipx"
brew "pocketbase"
brew "prettier"
brew "railway"
brew "rename"
brew "replicate"
brew "robot-framework"
brew "rust"
brew "s3cmd"
brew "sail"
brew "sd"
brew "sops"
brew "stripe-cli"
brew "supabase"
brew "tailspin"
brew "tektoncd-cli"
brew "tldr"
brew "tree"
brew "trippy"
brew "trivy"
# brew "x264"
# brew "x265"
# brew "xcbeautify" # iOS development
# brew "xcdiff" # iOS development
# brew "xcinfo" # iOS development
# brew "xclogparser" # iOS development
# brew "xcodegen" # iOS development
# brew "xcodes" # iOS development
# brew "xcprojectlint" # iOS development
brew "xe"
# brew xeol # container scanner but not popular
# brew "xh" # yet another httpie alternative
brew "xidel" # super useful for reading web pages I think
# brew "xonsh"
brew "xo/xo/usql"
# brew "xpdf" # PDF tool but not on GitHub
brew "xpipe" # the use case is interesting - splits input and feeds it to another command
brew "xq"
brew "xurls" # extracts urls from text - could be very useful
brew "xxh" # tool to ssh and bring your shell - useful, assuming it works
brew "vercel-cli"
brew "vultr"
brew "watch"
brew "wp-cli"
brew "wpscan"
# brew "yapf" # Google's Python formatter
brew "yorkie" # interesting, uses conflict-free replicated data types instead of raft
# brew "youplot"
brew "yt-dlp"
# brew "zx"

cask "blackhole-2ch"
cask "devkinsta"
cask "dropbox"
cask "fl-studio"
cask "framer"
cask "ilok-license-manager"
cask "inkscape"
cask "loopback"
cask "microsoft-auto-update"
cask "reaper"
cask "replay"
cask "surge-xt"
cask "visual-studio-code"

mas "hiddenbar", id: 1452453066
mas "telegram", id: 747648890
mas "vimari", id: 1480933944

vscode "astro-build.astro-vscode"
vscode "equinusocio.vsc-material-theme-icons"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-syntax"
vscode "ryuta46.multi-command"
vscode "styled-components.vscode-styled-components"