tap "hashicorp/tap"
tap "heroku/brew"
tap "replicate/tap"
tap "supabase/tap"
tap "xo/xo"

# GitHub & GitLab
brew "gh"
brew "git-open" # opens a GitHub page
brew "glab"

# Git
brew "blackbox" # encrypts and stores secrets in git
brew "commitizen"
brew "convco"
brew "gibo" # .gitignore generator
brew "git"
brew "gitleaks" # secrets audit
brew "lefthook" # hook manager
brew "ugit" # tries to undo a git command
# brew "changie" # changelog tool 
# brew "cocogitto" # commit message
# brew "codecov" # code coverage
# brew "commitlint" # probably intended to be installed locally per-project
# brew "cycode-cli" # another boring scanner
# brew "vcsh" # config manager based on git that manages subrepos


# Continuous Deployment
brew "act"
brew "action-validator"
brew "actionlint"
brew "circleci" # reproduces CircleCI environment locally
brew "dagger" # runs your pipeline in containers locally or remote, and with reusable functions and modules
brew "woodpecker-cli"


# Secrets
brew "bitwarden-cli"
brew "doppler" # very good and popular secrets manager
brew "hashicorp/tap/vault"
brew "sops"
brew "vsh" # community-created shell for Vault
# brew "trufflehog" # great tool - scans for secrets in CI logs, code comments, Git history, and more

# Docker Containers
brew "apko" # creates an image from an Alpine APK, without a Dockerfile
brew "cog" # by Replicate - creates containers for machine learning without a Dockerfile
brew "container-structure-test" # by Google - tests the structure of your container image
brew "copa" # patches a container image using reports from vulnerability scanners like trivy
brew "cosign"
brew "dive" # image explorer
brew "grype" # 
brew "nixpacks" # creates Docker images without a Dockerfile
brew "sysdig"
# brew "clair" # audits container using static analysis
# brew "ctop" # container top
# brew "cosign" # signs containers
# brew "diffoci" # compares two Docker images
# brew "trivy" scans container images, Kubernetes, Git repos, and AWS etc. (very popular tool)

# Provisioning - Terraform
brew "atlantis" # Terraform pull request automation – looks incredibly useful
brew "atmos" 
brew "aztfexport"
brew "cdktf" # cloud development kit for Terraform
brew "coder" # creates self-hosted development environments with Terraform and connects to it with Wireguard
brew "hashicorp/tap/terraform"
brew "k2tf" # converts Kubernetes YAML to Terraform HCL
brew "iam-policy-json-to-terraform" # converts a JSON IAM Policy to Terraform
brew "infracost" # cost estimates
brew "pulumi" # not Terraform, but similar enough
brew "terragrunt"
brew "terramate"
brew "tfsec"





# kubergrunt
# Collection of commands to fill in the gaps between Terraform, Helm, and Kubectl
# https://github.com/gruntwork-io/kubergrunt

# opentofu
# Drop-in replacement for Terraform. Infrastructure as Code Tool
# https://opentofu.org/

# tf-profile
# CLI tool to profile Terraform runs
# https://github.com/datarootsio/tf-profile

# tfautomv
# Generate Terraform moved blocks automatically for painless refactoring
# https://tfautomv.dev/

# tfenv
# Terraform version manager inspired by rbenv
# https://github.com/tfutils/tfenv

# tfk8s
# Kubernetes YAML manifests to Terraform HCL converter
# https://github.com/jrhouston/tfk8s

# tflint
# Linter for Terraform files
# https://github.com/terraform-linters/tflint

# tfmigrate
# Terraform/OpenTofu state migration tool for GitOps
# https://github.com/minamijoyo/tfmigrate

# tfproviderlint
# Terraform Provider Lint Tool
# https://github.com/bflad/tfproviderlint

# tfschema
# Schema inspector for Terraform/OpenTofu providers
# https://github.com/minamijoyo/tfschema

# tfsec
# Static analysis security scanner for your terraform code
# https://aquasecurity.github.io/tfsec/latest/

# tfupdate
# Update version constraints in your Terraform configurations
# https://github.com/minamijoyo/tfupdate

# tgenv
# Terragrunt version manager inspired by tfenv
# https://github.com/cunymatthieu/tgenv

# terracognita
# Reads from existing Cloud Providers and generates Terraform code
# https://github.com/cycloidio/terracognita

# terraform-docs
# Tool to generate documentation from Terraform modules
# https://github.com/terraform-docs/terraform-docs

# terraform-graph-beautifier
# CLI to beautify `terraform graph` output
# https://github.com/pcasteran/terraform-graph-beautifier

# terraform-inventory
# Go app which generates a dynamic Ansible inventory from a Terraform state file
# https://github.com/adammck/terraform-inventory

# terraform-local
# CLI wrapper to deploy your Terraform applications directly to LocalStack
# https://localstack.cloud/

# terraform-ls
# Terraform Language Server
# https://github.com/hashicorp/terraform-ls

# terraform-lsp
# Language Server Protocol for Terraform
# https://github.com/juliosueiras/terraform-lsp

# terraform-provider-libvirt
# Terraform provisioning with Linux KVM using libvirt
# https://github.com/dmacvicar/terraform-provider-libvirt

# terraform-rover
# Terraform Visualizer
# https://github.com/im2nguyen/rover

# terraform_landscape
# Improve Terraform's plan output
# https://github.com/coinbase/terraform-landscape

# terraformer
# CLI tool to generate terraform files from existing infrastructure
# https://github.com/GoogleCloudPlatform/terraformer

# terraforming
# Export existing AWS resources to Terraform style (tf, tfstate)
# https://terraforming.dtan4.net/

# terragrunt
# Thin wrapper for Terraform e.g. for locking state
# https://terragrunt.gruntwork.io/

# terragrunt-atlantis-config
# Generate Atlantis config for Terragrunt projects
# https://github.com/transcend-io/terragrunt-atlantis-config

# terrahelp
# Tool providing extra functionality for Terraform
# https://github.com/opencredo/terrahelp

# terrahub
# Terraform automation and orchestration tool
# https://docs.terrahub.io

# terramate
# Managing Terraform stacks with change detections and code generations
# https://terramate.io/docs/cli/

# terrapin-scanner
# Vulnerability scanner for the Terrapin attack
# https://terrapin-attack.com/

# terrascan
# Detect compliance and security violations across Infrastructure as Code
# https://github.com/tenable/terrascan

# Provisioning - Butane
brew "butane" # by Red Hat - converts a Butane YAML desired system configuration into a Ignition JSON configuration, both schema-validated
# brew "coreos-ct" # conflicts with chart-testing - converts Flatcar Container Linux config to Ignition config

# Provisioning - Packer
brew "hashicorp/tap/packer"


# Configuration - Ansible
brew "ansible"
brew "ansible-cmdb"
brew "ansible-creator"
brew "ansible-lint"
brew "molecule"

brew "djhtml" # indents Jinja templates


# Kubernetes - Basic
brew "colima" # container runtimes on macOS with minimal setup
brew "ctlptl" # sets up a cluster using only a YAML file, inspired by kubectl and clusterctl
brew "kubectl"
brew "minikube"
cask "rancher"

# Kubernetes - Continuous Deployment
brew "argo"
brew "argocd"
brew "argocd-autopilot"
brew "argocd-vault-plugin"
brew "conftest" # tests your Kubernetes configurations, Tekton pipeline definitions, and Terraform code using Open Policy Agent
brew "tektoncd-cli"
brew "werf" # it has 4000 stars, why are there so many Kubernetes toools

# Kubernetes - Cluster API
brew "clusterawsadm" # helpers for bootstrapping the Cluster API Provider for AWS, including commands for virtual machine images (AMI), the Kubernetes cluster (EKS), and access policies (IAM)
brew "clusterctl" # tool to provision, operate, and upgrade Kubernetes servers using the Cluster API

# Kubernetes - Security
brew "cmctl" # manages TLS certificates in Kubernetes via cert-manager


# Kubernetes - Everything Else
brew "arkade" # Kubernetes-packaged apps
brew "cdk8s" # cloud development kit for Kubernetes
brew "chaoskube" # periodically takes down random pods
brew "chart-testing" # helm chart testing
brew "click" # by Databricks - Kubernetes interactive controller
brew "confd" # manages application configuration files using templates and data from etcd or Consul
brew "cri-tools" # create, remove, list, inspect, start, and stop containers using the Kubelet Container Runtime Interface (CRI) Protobuf APIs
brew "cyctl" # really cool ui tool
brew "hashicorp/tap/consul" 
brew "hashicorp/tap/consul-template" # generates files from Consul data
brew "helm"
brew "helmfile"
brew "kompose"
brew "kops"
brew "kubescape"
brew "kustomize"
brew "k9s"
brew "okteto" # detects local file edits and automatically synchronizes changes to your Kubernetes remote development container
brew "opa"
brew "talhelper" # GitOps version controls your Talos configuration files and secrets using sops
brew "tilt" # run tilt up to create a Kubernetes development environment - 7.4k stars
brew "trivy"
brew "uffizzi" # Rails app apparently used by Spotify with or for Backstage
brew "vespa-cli" # by Yahoo - has a guide to deploy machine learning to Kubernetes
# brew "consul-backinator" # backup and restore Consul's key-value store
# brew "kubevirt"
# brew "vcluster" # creates fully functional virtual Kubernetes cluster inside the host Kubernetes cluster's namespace (whatever that even means)
# brew "velero" # backup and restore Kubernetes resources and persistent volumes
# brew "vitess" # replicated MySQL

# Nomad
brew "hashicorp/tap/nomad"


# Data Formats - JSON & YAML
brew "check-jsonschema"
brew "gron" # JSON to greppable output
brew "jc" # structures the output of any command into JSON
brew "jq"
brew "jql"
brew "yamale" # schema validator
brew "yamllint" # checker
brew "yh" # highlighter
brew "yj" # YAML to JSON or TOML or HCL converter
brew "yq" # jq for YAML, JSON, XML, CSV, and TOML

# Data Formats - CSV
brew "csvkit" # tools
brew "csvlens" # viewer
brew "csvtk" # csvkit alternative
brew "dasel" # jq for CSV, TOML, HTML, and JSON/YAML
brew "jtbl" # converts JSON to CSV or HTML or Markdown tables
brew "qsv" # one of the best - xsv replacement with a lot of features and documentation
brew "tidy-viewer" # viewer
brew "xsv" # looks very useful for csv files though kinda abandoned
# brew "csvq" # SQL queries for CSV
# brew "cqlkit" # exports Cassandra query as CSV or JSON
# brew "csvprintf" # formats CSVs from a table to separate lines
# brew "dsq" # another SQL query tool for CSV
# brew "psql2csv" # runs a query in PSQL and outputs the result as CSV

# Data Formats - TSV
brew "miller" # sed, awk, cut, join & sort for name-indexed data like TSV, CSV, JSON, and JSON Lines
brew "json2tsv"

# Data Formats - Protocol Buffer
brew "buf" # tool and schema registry
brew "grpcurl"
brew "ghz" # benchmarking tool

# Data Engineering - Databases
brew "atlas" # 
brew "goose" # database migration
# brew "tile38" # their landing page animation is very good - geolocation data store, spatial index, and realtime geofence


# Data Engineering - Observability
brew "chronograf" # monitoring and visualization UI for the Telegraf, InfluxDB, Chronograf, Kapacitor (TICK) stack
# brew "cortex" # long-term storage for Prometheus

# Google Cloud
brew "apib"    # api tool
brew "berglas" # secrets manager
brew "bigquery-emulator"
brew "c7n" # very useful gcp/aws audit tool
brew "checkov" # audits gcp/aws/terraform etc.
brew "cliam" # cloud agnostic IAM permissions enumerator
brew "cloud-nuke" # deletes all cloud resources in gcp/aws
brew "cloud-sql-proxy"
brew "cloudlist"
brew "cloudprober" # sends monitoring probes and integrates with Prometheus and Grafana
brew "firebase-cli"
brew "yatas" # audits gcp/aws audit
cask "google-cloud-sdk"

# AWS
brew "amazon-ecs-cli"
brew "athenacli"
brew "aws-amplify"
brew "aws-auth"
brew "aws-cdk"
brew "aws-console"
brew "aws-google-auth"
brew "aws-iam-authenticator"
brew "aws-keychain"
brew "aws-nuke"
brew "aws-rotate-key"
brew "aws-shell"
brew "aws-sso-cli"
brew "aws-vault"
brew "awscli"
brew "awscli-local"
brew "awscurl"
brew "awslogs"
brew "awsume"
brew "awsweeper"
brew "cf2tf" # converts CloudFormation templates to Terraform HCL
brew "cfn-flip" # converts CloudFormation templates to JSON or YAML
brew "cfn-format"
brew "cfn-lint"
brew "cfripper" # audits CloudFormation templates
brew "chamber" # manages secrets in AWS SSM Parameter Store
brew "cli53"
brew "cloudiscovery" # abandoned but may still work
brew "cloudformation-cli" # by Amazon - creates and manages CloudFormation extensions
brew "cloudformation-guard" # by Amazon - audits CloudFormation templates, Kubernetes configurations, and Terraform plans
brew "cloudfox" # penetration testing tool
brew "cloudsplaining" # audits IAM policies and generates a web report/worksheet
brew "copilot" # by Amazon - tool for Container Service and Fargate
brew "s3cmd"
# brew "credstash" # manages credentials in KMS


# Modern App Hosting Platforms
brew "convox" # by former Heroku engineers - no nixpacks or even buildpacks but can deploy apps like Rails to Kubernetes
brew "doctl" # buildpacks (old)
brew "heroku/brew/heroku" # buildpacks (old)
brew "nixpacks" # app source + Nix packages + Docker = image
brew "railway" # nixpacks
cask "devkinsta" # nixpacks but does not have a cli
# also, Northflank on npm, has nixpacks


# Cloudflare
brew "cloudflared"
brew "cloudflare-wrangler2"
brew "flarectl"
brew "wgcf" # generates WireGuard profile from Cloudflare Warp account

# Backblaze
brew "b2-tools"

# Contentful
brew "contentful-cli"

# Wordpress
brew "sail" # deploys to digitalocean
brew "wp-cli"
brew "wpscan"


# Diagrams
brew "awsdac" # diagram tool from aws labs
brew "d2" # terrastruct diagram tool
brew "manim"
# also, diagrams on pypi
# also, mermaid on npm


# Images 
brew "agg"  # converts Asciicast to GIF
brew "asciinema" # creates Asciicast file
brew "caire" # super useful content-aware image resizer
brew "ffmpeg" # extracts an image from a video
brew "imagemagick"
brew "viu" # view high-resolution images in the terminal
# brew "timg" # terminal image viewer
# brew "triangle" # converts an image to computer-generated art using Delaunay triangulation

# Networking - Application

# DNS
brew "airshare"
brew "bbot"
brew "bind" # dig
brew "checkdmarc"
brew "csprecon" # discovers target domains using content security policy
brew "dnsgen" # generates names from an existing one
brew "dnsrobocert" # sends a DNS challenge and generates a Let's Encrypt TLS certificate
brew "dnstracer"
brew "doggo"
brew "massdns"
# brew "dnscontrol" # by Stack Exchange - Synchronize DNS records to multiple providers using a DSL
# brew "dnsperf" # performance testing

# HTTP - API Server
brew "autorest" # by Microsoft - converts an OpenAPI specification to client code
brew "tygo" # converts a Go JSON API to TypeScript types for use in the frontend
brew "wiremock-standalone"
# brew "create-api" # converts an OpenAPI specification to Swift client code

# HTTP - API Client
brew "curl"
brew "curlie" # curl alternative, httpie-like
brew "httpie"
brew "hurl" # tests requests with plain text and curl
brew "newman" # runs Postman collections
brew "muffet" # checks for broken links
brew "webify" # turns a shell command into a web service
cask "postman"

# HTTP - Auth
brew "arjun" # hidden parameter discovery
brew "authz0" # tests authorization
brew "cotp" # generates two-step verification codes
brew "dalfox" # XSS scanner

# HTTP - Webhooks
brew "apprise" # very useful for sending notifications and triggering webhooks to popular notification services
brew "webhook" # lightweight incoming webhook server

# HTTP - WebSocket
brew "websocat" # command-line client for WebSockets
brew "websocketd" # turns any command-line program into a websocket server

# Certificates
brew "amass"
brew "badkeys" # finds common vulnerabilities in a public key
brew "ccheck" # certificate expiration checker
brew "certbot" # certificate automation
brew "certgraph" # crawls the graph of certificate Alternate Names and their website also links to huge crt.sh database
brew "certigo" # by Square - examines and validates certificates
brew "certstrap" # by Square - tools to bootstrap CAs, certificate requests, and signed certificates
brew "certsync"
brew "cfssl" # by Cloudflare - PKI/TLS toolkit
brew "openssl"
brew "tlsx" # scans for TLS vulnerabilities
brew "xpipe" # splits input and feeds it to another command - has use cases for certificates and more
brew "zlint" # certificate checker, see also zcertificate and zschema

# VPN
brew "bore-cli" # only 400 lines of code
brew "boringtun"
brew "vpn-slice"
cask "ngrok"
cask "tailscale"
# brew "wireguard-go"
# brew "wireguard-tools"

# Networking - Transport
brew "aerleon" # generates firewall configurations
brew "naabu"
brew "netcat"
brew "nmap"
brew "tcping"

# Networking - Routing
brew "asn"
brew "asnmap"
brew "asroute"
brew "bgpq4"
brew "bgpstream"
brew "cidr" # a lifesaver
brew "cidr2range"
brew "cidrmerge"
brew "gping"
brew "ipinfo-cli"
brew "lft"
brew "mtr"
brew "netaddr"
brew "nexttrace" # visual route tracking
brew "tracebox" # tries to detect intermediary in the path
brew "twoping" # bi-directional ping to determine which direction has packet loss
brew "whatmask"
# brew "trippy" # like mtr

# Networking - Data Link
brew "arp-scan"
brew "arping"
brew "cdpr" # cisco discovery protocol reporter

# Packet Captures
brew "tcpdump"
brew "yaf" # really useful networking data pipeline architecture and flow record display tool
cask "wireshark"
# brew "argus" # tcpdump alternative that has shows TCP state for each line such as CON FIN RST, or flow records whatever
# brew "argus-clients" 


# zsh
brew "argc"
brew "asdf"
brew "pure"
brew "zsh"
brew "zsh-autocomplete"
brew "zsh-autopair"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
# brew "clitest"
# brew "xonsh"
# brew "xxh" # tool to ssh and bring your shell - useful, assuming it works
# brew "zx"

# Utilities
brew "align"
brew "as-tree"
brew "bat"
brew "chalk-cli" # colorizes teminal text
brew "choose-rust" # cut and awk alternative
brew "comby" # sed replacement, matches with syntax instead of regexes
brew "dasht" # searches offline documentation aggregated by Dash
brew "difftastic" # super high-quality diff tool
brew "direnv" # sets and unsets environment variables per directory
brew "diskus" # directory size
brew "fd"
brew "grex" # regex generator
brew "hyperfine" # useful benchmarking tool
brew "openssh"
brew "rename"
brew "sd" # sed replacement
brew "tailspin" # colorizes log files
brew "tal"
brew "thefuck" # Corrects mistyped console commands
brew "tldr"
brew "tree"
brew "trurl" # by curl team - tr for URLs
brew "uni" # search unicode and emoji database
brew "viddy" # better watch command
brew "watch"
brew "watchexec" # watches files and triggers actions
brew "xe" # xargs replacement
cask "raycast" # can search DevDocs using an extension
# brew "titlecase" # capitalizes titles
# brew "tuc" # cut replacement
# brew "watchman" # by Facebook - watches files and triggers actions


# Programming
brew "corepack"
brew "deno"
brew "node@20"

brew "go"
brew "goreleaser"

brew "rust"

brew "pipx"
brew "python"
# brew "twine" # publishes Python package to PyPI

# Lightweight Formal Methods
# brew "dafny"


# macOS & iOS Development
# brew "chisel" # by Facebook - collection of LLDB commands
# brew "carthage" # 
# brew "cocoapods" # 
# brew "fastlane"
# brew "switchaudio-osx" # Change macOS audio source from the command-line
# brew "xcbeautify"
# brew "xcdiff"
# brew "xcinfo"
# brew "xclogparser"
# brew "xcodegen"
# brew "xcodes"
# brew "xcprojectlint"

# Everything else
brew "angle-grinder" # log analysis tool
brew "anycable-go"
brew "apibuilder-cli"
brew "apify-cli" # something about web scraping
brew "appwrite"
brew "artillery"
brew "ast-grep"
brew "azure-cli"
brew "buildpulse-test-reporter"
brew "dark-mode" # toggles dark mode
brew "erdtree"
brew "fabric"
brew "fclones"
brew "feroxbuster"
brew "flyctl"
brew "gdu"
brew "graphviz"
brew "hasura-cli"
brew "linode-cli"
brew "mas"
brew "md5deep"
brew "monolith"
brew "netlify-cli"
brew "oci-cli"
brew "pocketbase"
brew "replicate/tap/replicate" # runs machine learning models in their cloud
brew "robot-framework" # automation testing
brew "sops"
brew "stripe-cli"
brew "supabase"
brew "webpod" # deploys JavaScript apps to DigitalOcean, Linode, Vultr, GCP, AWS, or Azure
brew "xidel" # super useful for reading web pages I think
brew "xo/xo/usql"
brew "xq"
brew "xurls" # extracts urls from text - could be very useful
brew "vercel-cli"
brew "vultr"
brew "yorkie" # some app or whatever that uses conflict-free replicated data types instead of raft
brew "yt-dlp"
cask "blackhole-2ch"
cask "dropbox"
cask "fl-studio"
cask "framer"
cask "ilok-license-manager"
cask "inkscape"
cask "loopback"
cask "microsoft-auto-update"
cask "reaper"
cask "replay"
cask "surge-xt"
cask "visual-studio-code"
mas "hiddenbar", id: 1452453066
mas "telegram", id: 747648890
mas "vimari", id: 1480933944
vscode "Anan.devdocstab"
vscode "astro-build.astro-vscode"
vscode "equinusocio.vsc-material-theme-icons"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-syntax"
vscode "ryuta46.multi-command"
vscode "styled-components.vscode-styled-components"
# brew "apachetop"
# brew "bfs" # the GitHub page has a nice neutral tone terminal background
# brew "bpftop" # for Linux only but useful
# brew "brev" # cringe marketing but saving it here anyway
# brew "butane" for Linux only
# brew "c2rust"
# brew "caddy" # check this out for simpler server use cases than traefik
# brew "cadence-workflow" # Uber's workflow engine
# brew "calicoctl"
# brew "capnp" # apparently Cloudflare workers use this
# brew "cariddi" # does not look useful I just like go command line tools
# brew "cascadia" HTML selector tool
# brew "ccm" # cassandra
# brew "chatblade" # I just like the ffmpeg example
# brew "checkmake"
# brew "chezmoi"
# brew "chisel-tunnel" not useful but it's in go
# brew "chrome-cli"
# brew "cilium-cli"
# brew "cookiecutter" # scaffolds some Python projects
# brew "conduit" # Kafka Connect replacement, no JVM required
# brew "concurrencykit" # this is a C library, not a tool, but the data structures are interesting
# brew "cppinsights" # C++ web compiler
# brew "crane" # by Google - container registry tool with bad marketing
# brew "create-dmg"
# brew "crock" # send files to a friend
# brew "cromwell" # bioinformatics data engineering and workflows
# brew "crowdin" # tool to manage translation/localization projects on Crowdin
# brew "cubejs-cli" # some data pipeline thing, dunno, it has 17k stars
# brew "dashing" # generates Dash documentation from HTML files
# brew "denominator" # old abandoned Java code by Netflix but shows how to run a Java command without -jar
# brew "djl-serving" # Java is terrible but maybe this is educational for serving an ML model
# brew "istioctl"
# brew "tunnel" # ngrok alternative
# brew "ruff" fast Python formatter
# brew "telnet" # needed for eve-ng or gns3
# brew "tippecanoe" # creates pretty map vector tileset visualizations from GeoJSON, FlatGeobuf, or CSV
# brew "tinysearch" # sort of a website search backend but doesn't have any autocomplete functionality, so kind of useless
# brew "tty-share" # share your terminal with no tools needed on the remote side
# brew "typedb" # database focused on its type system - it mostly just has good marketing and documentation
# brew "typical" # data serialization and interchange with Rust algebraic data types
# brew "typst" # Markup-based typesetting system for math and science
# brew "tz" # time zone tool
# brew "uncover" # show exposed hosts on the internet using search engines
# brew "uv" # fast Python package installer
# brew "virtualhost.sh" # old but maybe useful to learn from
# brew "vivid" # has interesting filetypes database in YAML
# brew "voldemort" # by LinkedIn - database with decent documentation
# brew "vulsio-gost" # vulnerability tracker
# brew "vunnel" # collects vulnerability data
# brew "weasyprint" # HTML to PDF
# brew "whisperkit-cli" # runs OpenAI Whisper speech recongition models on macOS and iOS
# brew "wtfis"
# brew xeol # container scanner but not popular
# brew "xh" # yet another httpie alternative
# brew "xpdf" # PDF tool but not on GitHub
# brew "x264"
# brew "x265"
# brew "vsce" # tool for packaging and publishing a Visual Studio Code extension
# brew "yapf" # Google's Python formatter
# brew "youplot"