tap "hashicorp/tap"
tap "heroku/brew"
tap "replicate/tap"
tap "supabase/tap"
tap "xo/xo"


# GitHub
brew "gh"
brew "git-open"
brew "glab" # gitlab

# Git
brew "blackbox" # encrypts and stores secrets in git
brew "gibo" # .gitignore generator
brew "git"
brew "gitleaks" # secrets audit
brew "lefthook" # hook manager
# brew "changie" # changelog tool 
# brew "cycode-cli" # another boring scanner

# Continuous Integration
brew "act"
brew "action-validator"
brew "actionlint"
brew "bitwarden-cli"
brew "circleci" # reproduces the CircleCI environment locally
brew "woodpecker-cli"


# Docker
brew "apko" # creates a docker image from an alpine apk, without a dockerfile
brew "clair" # container static analysis audit
brew "cosign"
brew "dive" # docker image explorer
brew "nixpacks" # creates docker images without a dockerfile

# Terraform etc.
brew "atlantis" # terraform pull request automation – looks incredibly useful
brew "atmos" # terraform tool – marketing is horrible
brew "aztfexport"
brew "cdktf" # cloud development kit for terraform
brew "hashicorp/tap/packer"
brew "hashicorp/tap/terraform"
brew "pulumi"
brew "terragrunt"
brew "terramate"
brew "tfsec"


# Ansible
brew "ansible"
brew "ansible-cmdb"
brew "ansible-creator"
brew "ansible-lint"
brew "molecule"


# Kubernetes
brew "arkade" # kubernetes-packaged apps
brew "cdk8s" # cloud development kit for kubernetes
brew "chaoskube" # periodically takes down random pods
brew "chart-testing" # helm chart testing
brew "click" # by Databricks - Kubernetes interactive controller
brew "cyctl" # really cool ui tool
brew "helm"
brew "helmfile"
brew "kompose"
brew "kops"
brew "kubectl"
brew "kubescape"
brew "kustomize"
brew "k9s"
brew "minikube"
brew "okteto" # Detects local file edits and automatically synchronizes the code changes to your Kubernetes remote development container
brew "opa"
brew "trivy"
cask "rancher"

# Kubernetes - Continuous Integration
brew "argo"
brew "argocd"
brew "argocd-autopilot"
brew "argocd-vault-plugin"
brew "doppler" # secrets manager, looks popular I guess
brew "hashicorp/tap/vault"
brew "tektoncd-cli"
brwe "werf" # it has 4000 stars, why are there so many Kubernetes toools

# Nomad
brew "hashicorp/tap/nomad"


# Data Formats - JSON & YAML
brew "check-jsonschema"
brew "gron" # JSON to greppable output
brew "jq"
brew "jql"
brew "yamale" # schema validator
brew "yamllint" # checker
brew "yh" # highlighter
brew "yj" # YAML to JSON or TOML or HCL converter
brew "yq" # jq for YAML, JSON, XML, CSV, and TOML

# Data Formats - CSV
brew "xsv" # looks very useful for csv files though kinda abandoned

# Data Formats - Protocol Buffers
brew "buf" # tool and schema registry
brew "grpcurl"
brew "ghz" # benchmarking tool

# Observability
brew "chronograf" # monitoring and visualization UI for the Telegraf, InfluxDB, Chronograf, Kapacitor (TICK) stack

# Google Cloud
brew "apib"    # api tool
brew "berglas" # secrets manager
brew "bigquery-emulator"
brew "c7n" # very useful gcp/aws audit tool
brew "checkov" # gcp/aws/terraform etc. audit tool
brew "cliam" # cloud agnostic IAM permissions enumerator
brew "cloud-sql-proxy"
brew "firebase-cli"
brew "yatas" # gcp/aws audit tool
cask "google-cloud-sdk"

# AWS
brew "amazon-ecs-cli"
brew "athenacli"
brew "aws-amplify"
brew "aws-auth"
brew "aws-cdk"
brew "aws-console"
brew "aws-google-auth"
brew "aws-iam-authenticator"
brew "aws-keychain"
brew "aws-nuke"
brew "aws-rotate-key"
brew "aws-shell"
brew "aws-sso-cli"
brew "aws-vault"
brew "awscli"
brew "awscli-local"
brew "awscurl"
brew "awslogs"
brew "awsume"
brew "awsweeper"
brew "cf2tf" # converts CloudFormation templates to Terraform HCL
brew "cfn-flip" # converts CloudFormation templates to JSON or YAML
brew "cfn-format"
brew "cfn-lint"
brew "cfripper" # CloudFormation audit tool
brew "chamber" # manages secrets in AWS SSM Parameter Store
brew "cli53"
brew "cloud-nuke" # deletes all cloud resources aws or gcp etc.
brew "cloud-watch"
brew "s3cmd"

# Cloudflare
brew "cloudflared"
brew "cloudflare-wrangler2"
brew "flarectl"
brew "wgcf" # generates WireGuard profile from Cloudflare Warp account

# Backblaze
brew "b2-tools"


# Wordpress
brew "sail" # deploys to digitalocean
brew "wp-cli"
brew "wpscan"


# Image Processing 
brew "caire" # super useful content-aware image resizer
brew "imagemagick"


# Diagrams
brew "awsdac" # diagram tool from aws labs
brew "d2" # terrastruct diagram tool
brew "manim"
# also, diagrams on pypi
# also, mermaid on npm


# Networking - Application
# DNS
brew "airshare"
brew "bbot"
brew "bind" # dig
brew "checkdmarc"
brew "dnsgen"
brew "dnstracer"
brew "doggo"
brew "massdns"
# HTTP
brew "arjun" # hidden parameter discovery
brew "authz0"
brew "autorest" # by Azure - generates client library code from an OpenAPI specification
brew "curl"
brew "curlie" # curl alternative, httpie-like
brew "httpie"
brew "hurl"
brew "newman"
brew "muffet" # broken link checker
brew "webify" # incredibly useful - turns a shell command into a web service
brew "wiremock-standalone"
cask "postman"
# HTTP - Webhooks
brew "apprise" # very useful for sending notifications and triggering webhooks to popular notification services
brew "webhook" # lightweight incoming webhook server
# HTTP - WebSocket
brew "websocat" # command-line client for WebSockets
brew "websocketd" # turns any command-line program into a websocket server
# VPN
brew "bore-cli" # only 400 lines of code
brew "boringtun"
cask "ngrok"
cask "tailscale"
# brew "wireguard-go"
# brew "wireguard-tools"
# Captures
brew "tcpdump"
brew "yaf" # really useful networking data pipeline architecture and flow record display tool
cask "wireshark"
# brew "argus" # tcpdump alternative that has shows TCP state for each line such as CON FIN RST, or flow records whatever
# brew "argus-clients" 

# Networking - Transport
brew "aerleon" # generates firewall configurations
brew "naabu"
brew "netcat"
brew "nmap"

# Networking - Routing
brew "asn"
brew "asnmap"
brew "asroute"
brew "bgpq4"
brew "bgpstream"
brew "cidr" # a lifesaver
brew "cidr2range"
brew "cidrmerge"
brew "gping"
brew "ipinfo-cli"
brew "lft"
brew "mtr"
brew "nexttrace" # visual route tracking
brew "trippy"
brew "whatmask"

# Networking - Data Link
brew "arp-scan"
brew "arping"
brew "cdpr" # cisco discovery protocol reporter


# Certificates
brew "amass"
brew "badkeys" # finds common vulnerabilities in a public key
brew "ccheck" # certificate expiration checker
brew "certbot" # certificate automation
brew "certgraph" # crawls the graph of certificate Alternate Names and their website also links to huge crt.sh database
brew "certigo" # by Square - examines and validates certificates
brew "certstrap" # by Square - tools to bootstrap CAs, certificate requests, and signed certificates
brew "certsync"
brew "cfssl" # by Cloudflare - PKI/TLS toolkit
brew "openssl"
brew "xpipe" # splits input and feeds it to another command - has use cases for certificates and more
brew "zlint" # certificate checker, see also zcertificate and zschema


# zsh
brew "argc"
brew "asdf"
brew "direnv"
brew "pure"
brew "zsh"
brew "zsh-autocomplete"
brew "zsh-autopair"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
# brew "clitest"
# brew "xonsh"
# brew "zx"

# Utilities
brew "align"
brew "as-tree"
brew "bat"
brew "chalk-cli" # colorizes teminal text
brew "choose-rust" # alternative to cut and awk
brew "difftastic" # super high-quality diff tool
brew "fd"
brew "hyperfine" # useful benchmarking tool
brew "openssh"
brew "rename"
brew "sd" # sed replacement
brew "tldr"
brew "tree"
brew "watch"
brew "watchexec" # watches files and triggers actions
brew "xe" # xargs replacement
# brew "watchman" by Facebook - watches files and triggers actions


# Language Runtimes & Packagers
brew "corepack"
brew "node@20"

brew "go"
brew "rust"

brew "pipx"
brew "python"

# Everything else
brew "agg"  # converts Asciicast to GIF
brew "angle-grinder" # log analysis tool
brew "anycable-go"
brew "apibuilder-cli"
brew "apify-cli" # something about web scraping
brew "appwrite"
brew "artillery"
brew "asciinema"
brew "ast-grep"
brew "atlas" # looks useful, database tool
brew "azure-cli"
brew "buildpulse-test-reporter"
brew "c2rust"
brew "deno"
brew "doctl"
brew "erdtree"
brew "fabric"
brew "fastlane" # iOS development
brew "fclones"
brew "feroxbuster"
brew "ffmpeg"
brew "flyctl"
brew "gdu"
brew "goreleaser"
brew "goose" # database migration
brew "graphviz"
brew "grex" # regex generator
brew "grype"
brew "hasura-cli"
brew "heroku/brew/heroku"
brew "linode-cli"
brew "mas"
brew "md5deep"
brew "monolith"
brew "netlify-cli"
brew "oci-cli"
brew "pocketbase"
brew "railway"
brew "replicate/tap/replicate" # runs machine learning models in their cloud
brew "robot-framework" # automation testing
brew "sops"
brew "stripe-cli"
brew "supabase"
brew "tailspin" # colorizes log files
brew "webpod" # deploys JavaScript apps to DigitalOcean, Linode, Vultr, GCP, AWS, or Azure
brew "xidel" # super useful for reading web pages I think
brew "xo/xo/usql"
brew "xq"
brew "xurls" # extracts urls from text - could be very useful
brew "xxh" # tool to ssh and bring your shell - useful, assuming it works
brew "vercel-cli"
brew "vultr"
brew "yorkie" # some app or whatever that uses conflict-free replicated data types instead of raft
brew "yt-dlp"

# brew "apachetop"
# brew "bfs" # the GitHub page has a nice neutral tone terminal background
# brew "bpftop" # for Linux only but useful
# brew "brev" # cringe marketing but saving it here anyway
# brew "butane" for Linux only
# brew "caddy" # check this out for simpler server use cases than traefik
# brew "cadence-workflow" # Uber's workflow engine
# brew "calicoctl"
# brew "capnp" # apparently Cloudflare workers use this
# brew "cariddi" # does not look useful I just like go command line tools
# brew "carthage" # for iOS development
# brew "cascadia" HTML selector tool
# brew "ccm" # cassandra
# brew "chatblade" # I just like the ffmpeg example
# brew "checkmake"
# brew "chezmoi"
# brew "chisel" # by Facebook - collection of LLDB commands for iOS development
# brew "chisel-tunnel" not useful but it's in go
# brew "chrome-cli"
# brew "cilium-cli"
# brew "istioctl"
# brew "weasyprint" # HTML to PDF
# brew "whisperkit-cli" # runs OpenAI Whisper speech recongition models on macOS and iOS
# brew "wtfis"
# brew xeol # container scanner but not popular
# brew "xh" # yet another httpie alternative
# brew "xpdf" # PDF tool but not on GitHub
# brew "x264"
# brew "x265"
# brew "xcbeautify" # iOS development
# brew "xcdiff" # iOS development
# brew "xcinfo" # iOS development
# brew "xclogparser" # iOS development
# brew "xcodegen" # iOS development
# brew "xcodes" # iOS development
# brew "xcprojectlint" # iOS development
# brew "yapf" # Google's Python formatter
# brew "youplot"

cask "blackhole-2ch"
cask "devkinsta"
cask "dropbox"
cask "fl-studio"
cask "framer"
cask "ilok-license-manager"
cask "inkscape"
cask "loopback"
cask "microsoft-auto-update"
cask "reaper"
cask "replay"
cask "surge-xt"
cask "visual-studio-code"

mas "hiddenbar", id: 1452453066
mas "telegram", id: 747648890
mas "vimari", id: 1480933944

vscode "astro-build.astro-vscode"
vscode "equinusocio.vsc-material-theme-icons"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-syntax"
vscode "ryuta46.multi-command"
vscode "styled-components.vscode-styled-components"